app/controllers/chats_controller.rb

  def create
    @chat = current_user.chats.build(params[:chat])

    if @chat.save
---
INSERT INTO `chats` (`message`, `user_id`, `created_at`, `updated_at`) VALUES('fuck', 1, '2010-05-07 21:25:33', '2010-05-07 21:25:33')