app/controllers/comments_controller.rb

  def create
    @chat = Chat.find(params[:chat_id])
    @comment = @chat.comments.build(params[:comment])
    @comment.user = current_user

    if @comment.save
---
SELECT * FROM `chats` WHERE (`chats`.`id` = 1)
INSERT INTO `comments` (`message`, `user_id`, `chat_id`, `created_at`, `updated_at`) VALUES('bitch', 1, 1, '2010-05-07 21:26:15', '2010-05-07 21:26:15')