app/controllers/friendships_controller.rb

  def create
    friend = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def update
    friend = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def destroy
    friend = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1