app/controllers/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('UqtEgkAWHLn2a0IhB2e5', '2010-03-31 17:53:18', '2010-03-31 17:53:18', '4741eb85f06a2a382dcdd0b7288cf757d9bc68df7fba3f0f1cc3ff31e03a922152440a95f5afd8cd89129ecb23058ca6b5b97e683a327f3fb4b831e0518a4f1e', '4artupVJ9VNJLocyHwu7', '2010-03-31 17:53:18', 0, '127.0.0.1', '1IA9_vdrfLlbmuJMSKrf', '2010-03-31 17:53:18', 'f7d4baab072f5e98d7a90f450851aee17fba690a89e90bea20a83e00973a06932695c7c66ccf5be9c5cb600498dd5a1abf7052ef9672b29e9482e5a3f16e3cb8', 1, NULL, 'blatyo', NULL, 'blatyo@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def show
    @user = if params[:id]
      User.find(params[:id])

SELECT * FROM `users` WHERE (login like '%blatyo%')
---
  def index
    @query = params[:query]
    @users = User.search(@query)